[
"My Career Journey: A Path of Continuous Learning and Innovation",
"My journey in software development began in the late 1990s as a Technician at Litton Avondale Inc. I honed my skills in writing 3D to 2D code transformations, deploying network applications and building error-handling systems. These foundational skills have been invaluable throughout my career.",
"Early Development Experience",
"Litton Avondale Inc. (1999-2000)",
"As an Engineering Application Developer, I wrote 3D to 2D code transformations and managed network application deployment. I also developed error reporting/logging databases and front-ends, creating an Integrated Development Environment (IDE) for scripting 3D to 2D transformations.",
"Hancock Whitney (2001)",
"As a Programmer/Analyst I, I worked on desktop development, accessing DB2 data sources and implementing data applications with Argo Data. I also designed reporting and data access front-ends and created data-driven ASP pages.",
"Expanding My Horizons",
"Solid Earth Inc. (2007-2011)",
"As an Application Developer/Architect, I developed and maintained RETS client and server software powered by Oracle and C# using Win Forms and (link unavailable) I was lauded for having the fastest server in the continental US and was the first to achieve compliance on multiple occasions.",
"Rural Sourcing Inc. (2013-2016)",
"As a Sr. Software Developer, I mentored teams, managed projects and developed software applications using the Microsoft stack. I also recruited and interviewed candidates.",
"Leadership and Innovation",
"iAdvantage Software Inc. (2017-2021)",
"As a Lead Developer/Azure DevOps, I empowered users with dynamic data models and custom reporting features. I worked with cutting-edge technologies like (link unavailable) WebForms/MVC/WebAPI, OData/SOAP APIs and AngularJS.",
"Storable (2021-2022)",
"As a Full-time Developer, I developed and maintained .Net WinForms and web applications. I built backend services to support insurance auto-protect features using .net core, hangfire, postgres, sql server and entity framework.",
"Passion Projects and Interests",
"Interstellar Glassworks: A project blending logic and artistry.",
"AI integration and natural language processing.",
"3D spatial reasoning and machine learning.",
"Open-source communities and secure AI environments.",
"Career Reflections",
"Throughout my journey, I've embraced a continuous learning mindset, exploring new technologies and methodologies. My passion lies in fostering a culture of domain-driven design and pushing boundaries in coding and AI development. I'm committed to contributing meaningfully to the broader tech and creative landscapes."
]