{
    "about": [
        "My Career Journey: A Path of Continuous Learning and Innovation",
        "My journey in software development began in the late 1990s as a Technician at Litton Avondale Inc. I honed my skills in writing 3D to 2D code transformations, deploying network applications and building error-handling systems. These foundational skills have been invaluable throughout my career.",
        "Early Development Experience",
        "Litton Avondale Inc. (1999-2000)",
        "As an Engineering Application Developer, I wrote 3D to 2D code transformations and managed network application deployment. I also developed error reporting/logging databases and front-ends, creating an Integrated Development Environment (IDE) for scripting 3D to 2D transformations.",
        "Hancock Whitney (2001)",
        "As a Programmer/Analyst I, I worked on desktop development, accessing DB2 data sources and implementing data applications with Argo Data. I also designed reporting and data access front-ends and created data-driven ASP pages.",
        "Expanding My Horizons",
        "Solid Earth Inc. (2007-2011)",
        "As an Application Developer/Architect, I developed and maintained RETS client and server software powered by Oracle and C# using Win Forms and (link unavailable) I was lauded for having the fastest server in the continental US and was the first to achieve compliance on multiple occasions.",
        "Rural Sourcing Inc. (2013-2016)",
        "As a Sr. Software Developer, I mentored teams, managed projects and developed software applications using the Microsoft stack. I also recruited and interviewed candidates.",
        "Leadership and Innovation",
        "iAdvantage Software Inc. (2017-2021)",
        "As a Lead Developer/Azure DevOps, I empowered users with dynamic data models and custom reporting features. I worked with cutting-edge technologies like (link unavailable) WebForms/MVC/WebAPI, OData/SOAP APIs and AngularJS.",
        "Storable (2021-2022)",
        "As a Full-time Developer, I developed and maintained .Net WinForms and web applications. I built backend services to support insurance auto-protect features using .net core, hangfire, postgres, sql server and entity framework.",
        "Passion Projects and Interests",
        "Interstellar Glassworks: A project blending logic and artistry.",
        "AI integration and natural language processing.",
        "3D spatial reasoning and machine learning.",
        "Open-source communities and secure AI environments.",
        "Career Reflections",
        "Throughout my journey, I've embraced a continuous learning mindset, exploring new technologies and methodologies. My passion lies in fostering a culture of domain-driven design and pushing boundaries in coding and AI development. I'm committed to contributing meaningfully to the broader tech and creative landscapes."
    ],
    "skills": [
        {
            "name": "Agile Methodologies",
            "description": "A set of iterative and incremental software development approaches that emphasize adaptability, flexibility, and continuous improvement. Agile methodologies break down large projects into smaller, manageable units called sprints. This allows for faster feedback loops, quicker delivery of features, and better adaptation to changing requirements."
        },
        {
            "name": "AngularJS",
            "description": "A popular JavaScript framework for building dynamic web applications. AngularJS uses a declarative programming style and offers features like two-way data binding and dependency injection."
        },
        {
            "name": "Azure DevOps",
            "description": "A cloud-based DevOps platform that provides tools for planning, building, testing, and deploying software applications. Azure DevOps integrates with Microsoft Azure and other cloud platforms."
        },
        {
            "name": "Bootstrap",
            "description": "A popular front-end framework that provides a collection of CSS styles and JavaScript components for building responsive and mobile-friendly websites. Bootstrap can help developers create consistent and visually appealing user interfaces."
        },
        {
            "name": "C#",
            "description": "A general-purpose, object-oriented programming language developed by Microsoft. Widely used for building various types of software applications, including web applications, desktop applications, mobile applications, and games. Known for its strong typing, garbage collection, and integration with the .NET Framework and .NET Core."
        },
        {
            "name": "Cloud Platforms",
            "description": "Platforms that provide on-demand access to computing resources over the internet. Cloud platforms offer various services like infrastructure as a service (IaaS), platform as a service (PaaS), and software as a service (SaaS). Popular cloud platforms include Amazon Web Services (AWS), Microsoft Azure, and Google Cloud Platform."
        },
        {
            "name": "Cloud computing (Azure)",
            "description": "On-demand delivery of IT resources like servers, storage, databases, networking, software, analytics, and intelligence over the internet. Microsoft Azure is a leading cloud computing platform that offers a wide range of services for building, deploying, and managing applications on a global scale. Cloud computing provides scalability, elasticity, and cost-effectiveness for software development."
        },
        {
            "name": "Database development (SQL Server, Oracle)",
            "description": "The process of designing, creating, and managing databases to store and manage application data. SQL Server and Oracle are popular relational database management systems (RDBMS) used for various applications. Database development involves defining database schema, writing queries to retrieve and manipulate data, and ensuring data integrity and security."
        },
        {
            "name": "Databases",
            "description": "A collection of structured data that is organized in a way that allows it to be easily accessed, managed, and updated. Databases are essential for storing and managing the data used by software applications."
        },
        {
            "name": "DB2",
            "description": "A relational database management system from IBM. DB2 is widely used for enterprise applications and offers a comprehensive set of features for data management."
        },
        {
            "name": "Full-stack development",
            "description": "The ability to develop both the front-end (user interface) and back-end (server-side) components of a web application. Full-stack developers possess skills in various areas like programming languages, frameworks, databases, and APIs. This allows them to work independently on all aspects of a web application."
        },
        {
            "name": "Git",
            "description": "A popular version control system used for tracking changes to source code and other files. Git allows developers to collaborate efficiently and manage different versions of their projects."
        },
        {
            "name": "iOS",
            "description": "The operating system used on Apple devices like iPhones, iPads, and iPods."
        },
        {
            "name": "JIRA",
            "description": "A popular project management and issue tracking tool used by software development teams. JIRA helps teams plan, track, and manage their work, and provides features like Kanban boards, Scrum boards, and agile reporting."
        },
        {
            "name": "Kanban",
            "description": "A visual method for managing work that focuses on visualizing the workflow, limiting work in progress, and continuously improving the process. Kanban boards are often used to represent the different stages of a project, with cards representing tasks or items. Kanban is often used in combination with Agile methodologies."
        },
        {
            "name": "Leadership",
            "description": "The ability to influence, motivate, and inspire others to achieve a common goal. Effective leadership is essential for managing software development teams and driving successful projects."
        },
        {
            "name": "Mentoring",
            "description": "The process of guiding and supporting others in their career development. Mentoring can help junior developers learn new skills, grow their careers, and become more successful."
        },
        {
            "name": "Microsoft Azure",
            "description": "A leading cloud computing platform from Microsoft that offers a wide range of services for building, deploying, and managing applications on a global scale. Cloud computing provides scalability, elasticity, and cost-effectiveness for software development."
        },
        {
            "name": "Microsoft SQL Server",
            "description": "A popular relational database management system (RDBMS) from Microsoft. SQL Server is widely used for enterprise applications and offers a comprehensive set of features for data management."
        },
        {
            "name": "Mobile application development",
            "description": "The process of creating software applications for mobile devices like smartphones and tablets. Mobile app development involves using specific programming languages, frameworks, and tools to build apps for platforms like iOS and Android."
        },
        {
            "name": "Oracle",
            "description": "A popular relational database management system (RDBMS) used for various applications. Oracle offers a comprehensive set of features for data management, including data warehousing, data mining, and business intelligence."
        },
        {
            "name": "PL/SQL",
            "description": "A procedural language used to extend the capabilities of the Oracle database. PL/SQL allows developers to create stored procedures, functions, triggers, and packages to perform complex database operations."
        },
        {
            "name": "Problem-solving",
            "description": "The ability to identify and resolve issues effectively. Problem-solving skills are essential for software development, as developers often encounter challenges and need to find creative solutions."
        },
        {
            "name": "Project management",
            "description": "The application of knowledge, skills, tools, and techniques to plan, organize, and implement a project effectively. In software development, project management involves tasks like defining project scope, creating a development plan, allocating resources, tracking progress, and managing risks. Effective project management ensures projects are completed on time, within budget, and meet the desired quality standards."
        },
        {
            "name": "Regular Expressions",
            "description": "Powerful text pattern matching tool used for searching, manipulating, and validating text data. Commonly used in software development for tasks like data extraction, validation forms, and parsing complex text formats. Regular expressions provide a concise and efficient way to match specific patterns within strings."
        },
        {
            "name": "Software development",
            "description": "The process of creating computer programs and applications. Software development involves various stages, including planning, designing, coding, testing, and deployment."
        },
        {
            "name": "Team Building",
            "description": "The process of creating a cohesive and productive team environment.  In software development, effective team building fosters collaboration, communication, and problem-solving among developers, designers, project managers, and other stakeholders. This leads to a more efficient development process and higher quality software."
        },
        {
            "name": "Team management",
            "description": "The ability to lead and motivate a team of individuals to achieve a common goal. Effective team management involves setting clear expectations, providing guidance and support, and fostering a positive team culture."
        },
        {
            "name": "Time management",
            "description": "The ability to effectively manage your time and prioritize tasks. Good time management skills are essential for software developers to meet deadlines and deliver high-quality work."
        },
        {
            "name": "Unified Modeling Language (UML)",
            "description": "A standard visual language for software development. UML diagrams provide a way to represent the blueprint of a software system, including its classes, objects, relationships, interactions, and processes. UML helps developers visualize, design, document, and understand complex software systems."
        },
        {
            "name": "Visual Basic .NET",
            "description": "Another object-oriented programming language developed by Microsoft specifically for the .NET platform. Offers a visually intuitive syntax similar to Visual Basic for Applications (VBA) used in Microsoft Office products. Popular for rapid application development (RAD) and building Windows applications."
        },
        {
            "name": "Web development",
            "description": "The process of creating websites and web applications. Web developers use various technologies like: HTML, CSS, JavaScript and TypeScript."
        }
    ],
    "experience": [
        {
            "title": "Technician/Programmer",
            "company": "Computer Specialist",
            "location": "Bay St. Louis, MS",
            "dates": {
                "start": "1999-03-01",
                "end": "2000-03-31"
            },
            "description": [
                "Troubleshot and resolved software issues.",
                "Repaired and built IBM Clones running Windows 3.1-ME and Windows 4-2000.",
                "Created custom software for small businesses."
            ]
        },
        {
            "title": "Engineering Application Developer",
            "company": "Litton Avondale Inc.",
            "location": "New Orleans, LA",
            "dates": {
                "start": "1999-03-01",
                "end": "2000-12-31"
            },
            "description": [
                "Wrote 3D to 2D code transformations.",
                "Managed network application deployment.",
                "Developed error report/logging databases and front-ends.",
                "Developed an IDE for scripting 3D to 2D transformations."
            ]
        },
        {
            "title": "Design Consultant",
            "company": "Rainmaker Advertising & Design",
            "location": "Biloxi, MS",
            "dates": {
                "start": "2001-04-01",
                "end": "2002-10-31"
            },
            "description": [
                "Assisted in the design and implementation of IT systems.",
                "Developed components and frontends using VB6, VB.NET, ASP Classic, ASP.NET Web Forms, Microsoft Access, Microsoft InterDev, and Microsoft SQL Server."
            ]
        },
        {
            "title": "Web Developer/Consultant (PK Promotions)",
            "company": "PK Promotions",
            "location": "Biloxi, MS",
            "dates": {
                "start": "2004-06-01",
                "end": "2005-01-31"
            },
            "description": [
                "Developed web-based commodity production management systems.",
                "Developed product evolution tracking systems.",
                "Developed sales/marketing systems."
            ]
        },
        {
            "title": "Application Developer/Architect",
            "company": "Solid Earth Inc.",
            "location": "Huntsville, AL",
            "dates": {
                "start": "2007-01-01",
                "end": "2011-01-31"
            },
            "description": [
                "Developed and maintained RETS client and server software powered by Oracle and C#.",
                "Developed configurable ASP.NET web applications for distinct MLS custom implementations.",
                "Built a full statistics module with deep market analytics and reporting."
            ]
        },
        {
            "title": "Senior Software Developer",
            "company": "Rural Sourcing, Inc.",
            "location": "Augusta, Georgia Area",
            "dates": {
                "start": "2013-08-01",
                "end": "2016-02-29"
            },
            "description": [
                "Provided mentoring, team management, project management in relation to the Microsoft stack (Windows Development, Web Development, Database Development).",
                "Performed recruiting and interviewing tasks."
            ]
        },
        {
            "title": "Lead Developer / Azure DevOps",
            "company": "iAdvantage Software, Inc.",
            "location": "Cary, NC",
            "dates": {
                "start": "2017-03-01",
                "end": "2021-01-31"
            },
            "description": [
                "Empowered users with dynamic user-defined data models and custom reporting features compliant with 'Good Laboratory Practices'.",
                "Developed web applications using ASP.Net WebForms, MVC, WebAPI, RESTful OData, and SOAP APIs powered by Oracle (nHibernate, Entity Framework, PL/SQL).",
                "Built responsive web interfaces with CSS3, Flex Box, Bootstrap, and AngularJS.",
                "Developed offline capabilities using WinForms and Xamarin Forms apps."
            ]
        },
        {
            "title": "Software Engineer II",
            "company": "Storable",
            "location": "Cary, North Carolina, United States",
            "remote": true,
            "dates": {
                "start": "2021-02-01",
                "end": "2022-12-31"
            },
            "description": [
                "Developed and maintained .Net WinForms and web applications.",
                "Built backend services supporting insurance auto-protect feature using .Net Core, Hangfire, Postgres, SQL Server, Entity Framework, and other technologies.",
                "Established and taught patterns for unit testing in WinForms.",
                "Contributed ideas and design concepts to several initiatives in the company's growing adoption of domain-driven design."
            ]
        }
    ]
}